### 1. Продемонстрируйте два способа объявления одномерного массива, состоящего из 12 элементов типа double.
1) double d[] = new double[12];
2) double[] d = new double[12];
___
### 2. Покажите, как инициализировать одномерный массив целочисленными значениями от 1 до 5
``int x[] = { 1, 2, 3, 4, 5 };``
___
### 3. Напишите программу, в которой массив используется для нахождения среднего арифметического десяти значений типа double. Используйте любые десять чисел.
``Файл AvgDemo.java``
___
### 4. Измените программу, написанную в упражнении 5.1, таким образом, чтобы она сортировала массив строк. Продемонстрируйте ее работоспособность.
``Файл Bubble2.java``
___
### 5. В чем отличие методов ``indexOf()`` и ``lastlndexOf()`` класса String?
IndexOf() возвращает индекс первого вхождения подстроки str, а lastindexOf() – последнего.
___
### 6. Все символьные строки являются объектами типа String. Покажите, как вызываются методы ``length()`` и ``charAt()`` для строкового литерала "Мне нравится Java".
``
String str  = “Мне нравится Java”;
str.length();
str.charAt(index);

System.out.println("Мне нравится Java".length());
``
___
### 7. Расширьте класс Encode таким образом, чтобы в качестве ключа шифрования использовалась строка из восьми символов.
``Файл Encode2.java``
___
### 8. Можно ли применять побитовые операции к значениям типа double?
Нет, нельзя.
___
### 9. Перепишите приведенную ниже последовательность инструкций, воспользовавшись оператором ?.
```java
if(х < 0) у = 10;
else у = 20;
```
``result = x < 0 ? 10 : 20;``
___
### 10. В приведенном ниже фрагменте кода содержится знак &. Какой операции он соответствует: побитовой или логической? Обоснуйте свой ответ.
```java
boolean а, Ь;
// ...
if(а & Ь) ...
```
Это логическая операция, поскольку оба операнда относятся к типу boolean.
___
### 11. Является ли ошибкой превышение верхней границы массива? Является ли ошибкой использование отрицательных значений для доступа к элементам массива?
1) за границы массива выйти нельзя
2) индекс в массиве начинается с 0
___
### 12. Как обозначается операция сдвига вправо без знака?
``>>>``
___
### 13. Перепишите рассмотренный ранее класс MinMax таким образом, чтобы в нем использовался цикл типа for-each.
``Файл MinMax.java``
___
### 14. В упражнении 5.1 была реализована пузырьковая сортировка. Можно ли в программе из этого примера заменить обычный цикл for циклом типа for-each? Если нельзя, то почему?
Нельзя. for-each используется только для чтения элементов и не может менять элементы массива.
___
### 15. Можно ли управлять инструкцией switch с помощью объектов типа String?
Да, начиная с JDK 7 появилась такая возможность.
___
