### 1.	Почему в Java строго определены диапазоны допустимых значений и области действия простых типов?
Это правило соблюдается при создании виртуальных машин. Поскольку программы на Java должны быть переносимыми,
точное следование этим правилам является одним из основных требований языка.
___
### 2.	Что собой представляет символьный тип в Java и чем он отличается от символьного типа в ряде других языков программирования?
В отличии от других языков, в Java символы не являются 8-битовыми значениями.
Вместо этого используется кодировка Unicode, позволяющая представлять символы всех письменных языков.
___
### 3.	Переменная типа boolean может иметь любое значение, поскольку любое ненулевое значение интерпретируется как истинное. Верно или неверно?
Тип Boolean имеет только два значения: true и false.
___
### 4.	Допустим, результат выполнения программы выглядит следующим образом. "Один  Два  Три". Напишите строку кода с вызовом метода println(), где этот результат выводится в виде одной строки.
``System.out.println(“Один\nДва\nТри”);``
___
### 5.	Какая ошибка допущена в следующем фрагменте кода?  
```java
for(i = 0; i < 10; i++) { 
    int sum; 
    sum = sum + i; 
} 
System.out.println("Сумма: " + sum);
```
1) на каждом шаге цикла for, переменная sum заново создаётся.
2) переменная sum инициализирована во внутреннем блоке и не может использоваться вне этого блока. 
___
### 6.	Поясните различие между префиксной и постфиксной формами записи оператора инкремента.
Общее правило таково: префиксной форме записи операций инкремента и декремента соответствует изменение значения операнда
до его использования в соответствующем выражении, а постфиксной — после его использования.
___
### 7.	Покажите, каким образом укороченный логический оператор И может предотвратить деление на нуль.
```java
d = 0; // установить для d нулевое значение

// Второй операнд не вычисляется, поскольку значение
// переменной d равно нулю
if(d != 0 && (n % d) == 0)
  System.out.println(d + " является делителем " + n);
```
___
### 8.	До какого типа повышаются типы byte и short при вычислении выражения?
До типа с бОльшим диапазоном, т.е. до типа – int.
___
### 9.	Когда возникает потребность в явном приведении типов?
При приведении несовместимых типов.
___
### 10.	Напишите программу, которая находила бы все простые числа в диапазоне от 2 до 100.
``Файл PrimeNumber.java``
___
### 11.	Влияют ли лишние скобки на эффективность выполнения программ?
Не влияют.
___
### 12.	Определяет ли блок кода область действия переменных?
Да, определяет. Как правило, переменные, объявленные в некоторой области действия, невидимы (и, следовательно, недоступны) за ее пределами.
___
