### 1.	Что такое байт-код и почему он так важен для веб-программирования на языке Java?
Байт-код – это генерируемый компилятором Java код, который позволяет добиться безопасности 
и переносимости сетевых программ из одной среды в другую. Важен для веб-программирования он потому, 
что позволяет переносить и выполнять любую программу в любой среде, на любом типе процессора.
___
### 2.	Каковы три ключевых принципа ООП?
Инкапсуляция, полиморфизм, наследование. 
___
### 3.	С чего начинается выполнение программы на Java?
Входной точкой в программу на языке Java является метод main, который определен в классе Program. 
___
### 4.	Что такое переменная?
Переменная хранит в себе значение с определенным типом данных. 
___
### 5.	Какое из перечисленных ниже имен переменных недопустимо? A) count, B) $count, C) count27, D) 67count
A, D.
___
### 6.	Как создаются однострочные и многострочные комментарии?
Однострочные: //какой-то текст.  
Многострочные: /* какой-то текст */.
___
### 7.	Как выглядит общая форма условной инструкции if? Как выглядит общая форма цикла for?
```java
if(условие) инструкция;   
for(инициализация; условие; итерация) инструкция;
```
___
### 8.	Как создать блок?
С помощью { и }.
___
### 9.	Сила тяжести на Луне составляет около 17% земной. Напишите программу, которая вычислила бы ваш вес на Луне.
```java
public class Example {

    public static void main(String[] args) {
        
        double earth = 70;
        double moon;
        
        moon = (earth * 17) / 100;
        
        System.out.println("Your weight on the Moon equals " + moon);
    }
}
```
___
### 10.	Видоизмените программу, созданную в упражнении 1.2, таким образом, чтобы она выводила 
таблицу перевода дюймов в метры. После каждых 12 дюймов выведите пустую строку. (1 метр = 39,37 дюйма).
```java
public class Example {
    public static void main(String[] args) {
        double inch, meter;
        int counter;
        
        counter = 0;
        for(inch = 1; inch <= 100; inch++) {
            meter = inch * 39.37;
            System.out.println(inch + " дюймам соотвествует " +
                    meter + " метра");
            
            counter++;
            if(counter == 12) {
                System.out.println();
                counter = 0;
            }
        }
    }
}
```
___
### 11.	Если при вводе кода программы вы допустили опечатку, то какого рода сообщение об ошибке получите?
Exception in thread "main" java.lang.RuntimeException: Uncompilable code - cannot find symbol  
symbol:   class doule
___
### 12.	Имеет ли значение, с какой именно позиции в строке начинается инструкция?
В Java допускается произвольное оформление исходного кода, а это означает, 
что расположение инструкций относительно друг друга не имеет особого значения.
___
