### 1.	Напишите программу, которая считывает символы с клавиатуры до тех пор, пока не встретится точка. 
Предусмотрите в программе счетчик пробелов. Сведения о количестве пробелов должны выводиться в конце программы.
``Файл FindDot.java``
___
### 2.	Каков общий синтаксис многоступенчатой конструкции if-else-if?
```java
if(условие) инструкция;
else if(условие) инструкция;
. . .
else инструкция;
```
___
### 3.	Допустим, имеется следующий фрагмент кода. С какой из инструкций i f связана последняя ветвь else?
```java
if(x < 10)
	if(y > 100) {
		if(!done) x = z;
		else y = z;
	}
else System.out.println(“error”); // к какой инструкции if относится?
```
С if(x < 10).
___
### 4.	Напишите цикл for, в котором перебирались бы значения от 1000 до 0 с шагом 2
``for(int i = 1000; i <= 0; i – 2);``
___
### 5.	Корректен ли следующий фрагмент кода?
```java
for(int i = 0; i < num; i++)
	sum += i;
count = i;
```
Нет. Переменная i не может быть использована вне цикла for.
___
### 6.	Какие действия выполняет инструкция break? Опишите оба варианта этой инструкции.
break; - досрочный выход из цикла.
break метка; - выход из одного или нескольких циклов по метке. 
___
### 7.	Какое сообщение будет выведено после выполнения инструкции break в приведенном ниже фрагменте кода?
```java
for(i = 0; i < 10; i++) {
		while(running) {
			if(x < y) break;
			// ...
		}
		System.out.println(“После while”);
}
System.out.println(“После for”);
```
После for.
___
### 8.	Что будет выведено на экран в результате выполнения следующего фрагмента кода?
```java
for(int i = 0; i < 10; i++) {
		System.out.print(i + “ “);
		if((i % 2) == 0) continue;
		System.out.println();
}
```
0 1  
2 3  
4 5  
6 7  
8 9  
___
### 9.	Итерационное выражение для цикла for не обязательно должно 
изменять переменную цикла на фиксированную величину. Эта переменная может принимать произвольные значения. 
Напишите программу, использующую цикл for для вывода чисел в геометрической прогрессии: 1, 2, 4, 8, 16, 32 и т.д

___
### 10.	Коды ASCII-символов нижнего регистра отличается от кодов соответствующих символов верхнего 
регистра на величину 32. Следовательно, для преобразования строчной буквы в прописную нужно
уменьшить ее код на 32. Используйте это обстоятельство для написания программы, читающей символы с клавиатуры.
При выводе результатов данная программа должна преобразовывать строчные буквы в прописные, а прописные — в строчные. 
Остальные символы не должны меняться. Работа программы должна завершаться после того, как пользователь введет с клавиатуры точку. 
И наконец, сделайте так, чтобы программа отображала количество символов, для которых был изменен регистр
``Файл LowUpCase.java``
___
### 11.	Что такое бесконечный цикл?
Цикл, не имеющий условия для его окончания. 
___
### 12.	Должна ли метка, используемая вместе с инструкцией break, быть определена в блоке кода, содержащем эту инструкцию?
Нет. Метка может быть вне блока кода, стоять перед циклом или, непосредственно, перед открывающей фигурной скобкой.
___
